/* global tw */
import React from 'react';
import styled from 'react-emotion';

const LongDesc = styled.p`
  ${tw('hidden sm:block text-grey-light text-sm  md:text-2xl lg:text-3xl   pt-6 md:pt-12 text-justify')};
`;

const ShortDesc = styled.p`
  ${tw('block sm:hidden text-grey-light text-lg  pt-6 md:pt-12 text-justify')};
`;

const AboutDesc = () => (
  <div>
    <LongDesc>
      دوره آموزشی «جادوگران آینده» بر اساس جدیدترین متدهای آموزشی تدوین شده است. تمرکز این دوره بر «الگوریتم» و «کار
      تیمی» است که مهمترین مهارت های لازم برای کدنویسان ممتاز است. در طی این دوره پرورش عنصر تخیل کودکان مورد توجه
      بسیاری است. چرا که از طرفی برنامه نویسی کاری است، بسیار «خلاقانه» و از طرف دیگر فانتزی و تخیل نقش پررنگی در علاقه
      مند نمودن کودکان و نوجوانان به آموزش و یادگیری دارد تحقیقات روانشناسان نشان داده است که یادگیری کودکان در فضای
      فانتزی بسیار بیشتر از فضای واقعی اتفاق می افتد.
    </LongDesc>
    <ShortDesc>
      در این دوره که بر اساس جدید ترین متد آموزشی تدوین شده است، پرورش عنصر تخیل کودکان مورد توجه بسیاری است. چرا که از
      طرفی برنامه نویسی کاری است، بسیار «خلاقانه» و از طرف دیگر «فانتزی» و «تخیل» نقش پررنگی در علاقه مند نمودن نوجوانان
      به آموزش دارد تحقیقات روانشناسان نشان داده است که یادگیری کودکان در فضای فانتزی بسیار موثرتر از فضای واقعی است
    </ShortDesc>
  </div>
);

export default AboutDesc;
